#include <stdio.h>

 float remainder(int a, int b) {
	 float k = a % b;
	 if (k < 0) k += abs(b);
	 return k;
}
 void main() {
  // Задание 1
	 int a1 = 27; int b1 = 4;
	 int a2 = -15; int b2 = 4;
	 int a3 = 113; int b3 = -3;
	 int a4 = -15; int b4 = -7;
	 printf("The remainder of division %d and %d is %f\n", a1, b1, remainder(a1, b1));
	 printf("The remainder of division %d and %d is %f\n", a2, b2, remainder(a2, b2));
	 printf("The remainder of division %d and %d is %f\n", a3, b3, remainder(a3, b3));
	 printf("The remainder of division %d and %d is %f\n\n", a4, b4, remainder(a4, b4));
  //----------------------------------------------------------------------------------

  // Задание 2
	 // (1)
	 int inc = 25;
	 inc++;
	 printf("%d\n", inc);
	 ++inc;
	 printf("%d\n\n", inc); //  Расположение ++ (инкремент) относительно элемента влияет в циклах

	 // (2)
	 int dec = 11;
	 dec--;
	 printf("%d\n", dec);
	 --dec;
	 printf("%d\n\n", dec); // Расположение -- (декремент) относительно элемента влияет в циклах, как и ++ (инкремент)
  
     // (3)
	 int a = 35;
	 int b = 11;
     printf("%d\n", a);
	 printf("%d\n%d\n%d\n\n", a + b, a += b, a);

	 // (4,5,6,7)
	 // Аналогично (3):
	 // a -= b  <=> a = a - b
	 // a *= b <=> a = a * b
	 // a /= b <=> a = a / b
	 // a %= b <=> a = a % b

  // Задание 3
	 // (1)
	 // == Проверка условия равенства
	 // (2)
	 // != Проверка условия не равенства
	 // (3)
	 //  > Проверка условия строго больше
	 // (4)
	 //  < Проверка условия строго меньше
	 // (5)
	 // >= Проверка условия больше или равно
	 // (6)
	 // <= Проверка условия меньше или равно

  // Задание 4
	 // (1)
	 // &&  - логическое И (and)
	 int ask1 = 10;
	 int ask2 = 15;
	 if ((ask1 >= ask2) && (ask2 <= ask1)) {
		 printf("ask1 = ask2 \n");
	 } else {
		 printf("ask1 != ask2 \n");
	 }

	 // (2)
	 // || - логическое ИЛИ (or)

	 int osk1 = 26;
	 int osk2 = 26;
	 if ((osk1 < osk2) || (osk2 - osk1 < 0)) {
		 printf("osk1 != osk2 \n");
	 } else {
		 printf("osk1 = osk2 \n");
	 }


	 // (3)
	 // ! - логическое НЕ (not)

	 int n = 0;
	 if (!n == 0) {
		 printf("TRUE \n\n");
	 } else {
		 printf("FALSE \n\n");
	 }

  //----------------------------------------------------------------------------------

  // Задание 4

	 // (1)
	 // | Побитовое ИЛИ

	 unsigned char f0 = 132;        
	 unsigned char l0 = 177;             
	 printf("%d\n\n", f0 | l0); // 132 = 10000100
	                            // 177 = 10110001
	                            // ans = 10110101 (Должно быть 128 + 53 = 181, (но для signed char 1-й бит = но 1-й бит - положительность/отрицательность числа, 1 = отрицательное, 0 = положительное,
	                            // Поэтому (???) ответ -128 + 53 = -75

	 // (2)
	 // & Побитовое И

	 char f1 = 214;           
	 char l1 = 193;           
	 printf("%d\n", f1 & l1);    // 214 = 11010110
	                             // 193 = 11000001
	                             // ans = 11000000 (Должно быть 64 + 128 = 192, (signed char) но 1-й бит - положительность/отрицательность числа, 1 = отрицательное, 0 = положительное, 
	                             // поэтому ответ -64 (?? -128 + 64 = -64)

	 char f2 = '214';            // ?????
	 char l2 = '193';            // ?????
	 printf("%d\n", f2 & l2);    // ?????

	 char f3 = "214";            // ??????????
	 char l3 = "193";            // ??????????
	 printf("%d\n\n", f3 & l3);  // ??????????

	 // (3)
	 // ~ Побитовая инверсия

	 unsigned char uf1 = (unsigned char)f1;
	 printf("%d\n\n", ~uf1);

	 char inversion = 382 ;
	 printf("%d\n\n", ~inversion); // Для signed char
	                               // При 127 >= inversion >= -128: знак перед числом меняется на противоположный и прибавляется -1. ( ~113 = -114)
	                               // При иных значениях inversion  мы попадаем в цикл где:
	                               // ~128 = ~-128 = 127; ~129 = ~-127 = 126; ~-129 = ~127 = -128 ....
	                               // ~512 = ~256 = ~-256 = ~0 = -1 ....
	                               // ~-513 = ~-257 = ~255 = ~1 = 0 ....
	                               // ~-130 = ~126 = ~(126 + 256) = ~382 = -127 ....

	 // (4)
	 // ^ - Исключающее ИЛИ

	 char xor1 = 178;
	 char xor2 = 162;
	 printf("%d\n\n", xor1 ^ xor2);    // 178 = 10110010
	                                   // 162 = 10100010
	                                   // ans = 00010000 

	 // (5)
	 // << - Побитовый сдвиг влево
	 // >> - Побитовый сдвиг вправо

	 char seek1 = 14;
	 int seek2 = 3;                    
	 printf("%d\n", seek1 << seek2);    // (Умножение на 2) seek2 раз.
	 printf("%d\n", seek1 >> seek2);    // (Целочисленное деление на 2) seek2 раз.
 }